# brew taps

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

# 'brew install' via  `brew "[packagename]"``
brew "python@3.12"

# 'brew install --cask' via `cask "[packagename]"`
cask "android-file-transfer"
cask "anki"
cask "basecamp"
cask "caffeine"
cask "calibre"
cask "discord"
cask "firefox"
cask "grandperspective"
cask "hey"
cask "joplin"
cask "pocket-casts"
cask "send-to-kindle"
cask "signal"
cask "sonos"
cask "sony-ps-remote-play"
cask "spotify"
cask "steam"
cask "tailscale"
cask "transmission"
cask "utm"
cask "vivaldi", greedy: true


# 'mas install' via `mas "[packagename], id: [idnumber]`
mas "Garageband", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Microsoft RDP", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541


# 'vscode --install-extension' via `vscode "[identifier]"`
